<?php

use Illuminate\Database\Seeder;

class AppCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            '游戏' => [
                '休闲益智' => [
                    '休闲' => [],
                    'IO' => [],
                    '益智' => [],
                    '消除' => [],
                    '音乐节奏'=>[],
                    '解谜' => [],
                ],
                '经营策略' => [
                    '塔防' => [],
                    '古代谋略' => [],
                    '现代战略' => [],
                    '经营' => [],
                    '养成' => [],
                    'MOBA' => [],
                ],
                '体育竞速' => [
                    '赛车' => [],
                    '篮球' => [],
                    '运动' => [],
                    '足球' => [],
                ],
                '棋牌中心' => [
                    '斗地主' => [],
                    '麻将' => [],
                    '桌游与棋类' => [],
                    '纸牌' => [],
                    '捕鱼' => [],
                ],
                '飞行射击' => [
                    '射击' => [],
                    '格斗' => [],
                    '跑酷' => [],
                    '打飞机' => [],
                ],
                '角色扮演' => [
                    '多人在线' => [],
                    '卡牌' => [],
                    '动作' => [],
                    '冒险' => [],
                    '回合制' => [],
                    '生存' => [],
                    '放置挂机' => [],
                    '仙侠' => [],
                    '武侠' => [],
                    '传奇' => [],
                    '魔幻' => [],
                ]
            ],
            '应用' => [
                '影音娱乐' => [
                    '电视' => [],
                    '视频' => [],
                    '音乐' => [],
                    'K歌' => [],
                    '直播' => [],
                    '电台' => [],
                ],
                '实用工具' => [
                    '浏览器' => [],
                    '输入法' => [],
                    '闹钟' => [],
                    '工具' => [],
                    '安全性能' => [],
                    'WiFi' => [],
                ],
                '社交通讯' => [
                    '聊天' => [],
                    '社区' => [],
                    '通讯' => [],
                    '婚恋' => [],
                ],
                '教育' => [
                    '翻译' => [],
                    '英文' => [],
                    '学习' => [],
                    '备考' => [],
                ],
                '新闻阅读' => [
                    '电子书' => [],
                    '新闻' => [],
                    '杂志' => [],
                    '有声读物' => [],
                    '动漫' => [],
                    '幽默' => [],
                    '体育' => [],
                ],
                '拍摄美化' => [
                    '拍照' => [],
                    '短视频' => [],
                    '美化' => [],
                    '影音编辑' => [],
                    '相册图库' => [],
                ],
                '美食' => [
                    '菜谱' => [],
                    '外卖' => [],
                    '餐饮' => [],
                    '生鲜' => [],
                ],
                '出行导航' => [
                    '地图' => [],
                    '导航' => [],
                    '交通票务' => [],
                    '用车' => [],
                    '公交地铁' => [],
                ],
                '旅游住宿' => [
                    '旅游' => [],
                    '住宿' => [],
                    '行程助手' => [],
                ],
                '购物比价' => [
                    '商城' => [],
                    '导购' => [],
                    '团购' => [],
                    '海淘' => [],
                    '快递' => [],
                    '优惠' => [],
                ],
                '商务' => [
                    '办公' => [],
                    '效率' => [],
                    '笔记' => [],
                    '邮箱' => [],
                    '招聘' => [],
                ],
                '儿童' => [
                    '早教' => [],
                    '儿歌' => [],
                    '母婴' => [],
                ],
                '金融理财' => [
                    '银行' => [],
                    '股票基金' => [],
                    '理财' => [],
                    '记账' => [],
                    '贷款' => [],
                ],
                '运动健康' => [
                    '运动' => [],
                    '健康' => [],
                    '养生' => [],
                    '医疗' => [],
                ],
                '便捷生活' => [
                    '家政' => [],
                    '本地生活' => [],
                    '租房买房' => [],
                    '家居装修' => [],
                    '电影票' => [],
                    '天气日历' => [],
                ],
                '汽车' => [
                    '养车' => [],
                    '违章查询' => [],
                    '汽车资讯' => [],
                    '驾考' => [],
                ],
                '主题个性' => [
                    '铃声' => [],
                    '锁屏' => [],
                    '壁纸' => [],
                ],
            ]
        ];

        foreach ($data as $lk1 => $lv1) {
            $l1 = \App\Models\AppCategory::create([
                'pid' => 0,
                'name' => $lk1
            ]);
            foreach ($lv1 as $lk2 => $lv2) {
                $l2 = \App\Models\AppCategory::create([
                    'pid' => $l1->id,
                    'name' => $lk2,
                ]);
                foreach ($lv2 as $lk3 => $lv3) {
                    \App\Models\AppCategory::create([
                        'pid' => $l2->id,
                        'name' => $lk3,
                    ]);
                }
            }
        }
    }
}
